import React, {useState} from 'react'
import style from "./income.module.css"
import Table from "../../../../components/table/table"
import { Button } from '@material-ui/core';
import AddDocument from "../Add_Document/AddModal"

export default function Income() {
    const [openAddDocument, setOpenAddDocument] = useState(false)
    const [rowData, setRowData] = useState([
        {"#":1, Մատակարար: "Toyota", Պահեստ: "Celica", Ամսաթիվ: 35000, Քանակ: 35000, Նկարագիր: 35000, "Գին առանց ԱԱՀ-ի": 35000, "ԱԱՀ Գում․": 35000, "Առքի գումար": 35000, "Վճարված է": 35000, "Հաշիվ-Ապրանքագիր":100, "ՀՎՀՀ": 100, },
        {"#":2, Մատակարար: "Toyota", Պահեստ: "Celica", Ամսաթիվ: 35000, Քանակ: 35000, Նկարագիր: 35000, "Գին առանց ԱԱՀ-ի": 35000, "ԱԱՀ Գում․": 35000, "Առքի գումար": 35000, "Վճարված է": 35000, "Հաշիվ-Ապրանքագիր":100, "ՀՎՀՀ": 100, },
        {"#":3, Մատակարար: "Toyota", Պահեստ: "Celica", Ամսաթիվ: 35000, Քանակ: 35000, Նկարագիր: 35000, "Գին առանց ԱԱՀ-ի": 35000, "ԱԱՀ Գում․": 35000, "Առքի գումար": 35000, "Վճարված է": 35000, "Հաշիվ-Ապրանքագիր":100, "ՀՎՀՀ": 100, },
        {"#":4, Մատակարար: "Toyota", Պահեստ: "Celica", Ամսաթիվ: 35000, Քանակ: 35000, Նկարագիր: 35000, "Գին առանց ԱԱՀ-ի": 35000, "ԱԱՀ Գում․": 35000, "Առքի գումար": 35000, "Վճարված է": 35000, "Հաշիվ-Ապրանքագիր":100, "ՀՎՀՀ": 100, },
        {"#":5, Մատակարար: "Toyota", Պահեստ: "Celica", Ամսաթիվ: 35000, Քանակ: 35000, Նկարագիր: 35000, "Գին առանց ԱԱՀ-ի": 35000, "ԱԱՀ Գում․": 35000, "Առքի գումար": 35000, "Վճարված է": 35000, "Հաշիվ-Ապրանքագիր":100, "ՀՎՀՀ": 100, },
        {"#":6, Մատակարար: "Toyota", Պահեստ: "Celica", Ամսաթիվ: 35000, Քանակ: 35000, Նկարագիր: 35000, "Գին առանց ԱԱՀ-ի": 35000, "ԱԱՀ Գում․": 35000, "Առքի գումար": 35000, "Վճարված է": 35000, "Հաշիվ-Ապրանքագիր":100, "ՀՎՀՀ": 100, },
        {"#":7, Մատակարար: "Toyota", Պահեստ: "Celica", Ամսաթիվ: 35000, Քանակ: 35000, Նկարագիր: 35000, "Գին առանց ԱԱՀ-ի": 35000, "ԱԱՀ Գում․": 35000, "Առքի գումար": 35000, "Վճարված է": 35000, "Հաշիվ-Ապրանքագիր":100, "ՀՎՀՀ": 100, },
        {"#":8, Մատակարար: "Toyota", Պահեստ: "Celica", Ամսաթիվ: 35000, Քանակ: 35000, Նկարագիր: 35000, "Գին առանց ԱԱՀ-ի": 35000, "ԱԱՀ Գում․": 35000, "Առքի գումար": 35000, "Վճարված է": 35000, "Հաշիվ-Ապրանքագիր":100, "ՀՎՀՀ": 100, },
    ]);
    return (
        <div className={style.fullContainer} >
            <AddDocument 
                open={openAddDocument} 
                setOpen={setOpenAddDocument}

            />
            <Button onClick={()=>{setOpenAddDocument(true)}} >Ավելացնել փաստաթուղթ</Button>
            <Table rowData={rowData} />
        </div>
    )
}
